MonsJovis/esp-flight-monitor/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash: 16 MB quad (AGENTS.md §2 — verified on the unit)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM: 8 MB octal @ 80 MHz. 120 MHz is experimental and temperature-sensitive
# for an always-on panel — AGENTS.md §7 says stay at 80.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Tearing mitigation for espressif/esp-bsp#570. NOTE: this also relocates .rodata
# into PSRAM, and LVGL fonts ARE .rodata — the font set therefore competes with the
# framebuffer for PSRAM bandwidth. Measured in PLAN.md M1.
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# Cache
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Plain HTTP only — no TLS anywhere (AGENTS.md §4: ~40 KB more heap per connection)
CONFIG_ESP_TLS_INSECURE=n

# LVGL: enable a large built-in face so M1 has a baseline to measure our own
# 100 px PSRAM-resident font against.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_48=y
# CONFIG_LV_USE_PERF_MONITOR is deliberately off: it overlays the bottom-right
# corner of every screen. Turn it on to re-run the M1 benchmark, not to ship.
# CONFIG_LV_USE_PERF_MONITOR is not set

# Console on USB-Serial-JTAG rather than UART0. The board exposes a native USB
# port, so this removes the 115200 baud ceiling — which matters because the
# framebuffer grab in main/debug/dbg_screen.c moves 450 KiB per screenshot.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_LV_USE_SYSMON=y
CONFIG_LV_PERF_MONITOR_ALIGN_BOTTOM_RIGHT=y

# Custom partition table — the font set does not fit the 1 MB default app slot.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Framebuffers: MEASURED on the unit, not guessed (PLAN.md M1, AGENTS.md §8 open #1).
# Full-screen invalidate every frame, 100 px face on screen:
#   1 fb, no anti-tear : 21.4 FPS,  6.62 MB PSRAM free
#   2 fb, anti-tear    : 28.5 FPS,  5.88 MB PSRAM free
#   3 fb, anti-tear    : 28.4 FPS,  5.42 MB PSRAM free
# Two is strictly better than one — faster AND tear-free. Three buys nothing and
# costs another 461 KB. Settled: two.
CONFIG_BSP_LCD_RGB_BUFFER_NUMS=2
CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR=y
CONFIG_BSP_DISPLAY_LVGL_DIRECT_MODE=y

# Internal SRAM budget. WiFi + lwIP took internal free from 125 KB down to
# 24.8 KB, with a 17 KB largest block — too tight to be comfortable for an
# always-on device, and the reason the plain-HTTP decision keeps paying off
# (a TLS handshake needs ~40 KB and simply would not fit).
#
# The payload we actually move is ~8-34 KB of JSON over one connection at a
# time, every 12 s. These buffer counts are sized for that, not for throughput.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_RX_BA_WIN=4
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
# lwIP mailbox and socket counts are left at their DEFAULTS on purpose. An
# earlier version of this file shrank them to claw back internal SRAM, and it
# broke outbound TCP: connect() timed out in select() on a network where the
# same request from a laptop completed in 40 ms. A tcpip mailbox that is too
# small silently drops packets — including the SYN-ACK — so the failure looks
# like an unreachable host rather than like a tuning mistake, which cost far
# more time than the ~6 KB it saved. The WiFi buffer counts above are the part
# that was actually safe to reduce.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5744
CONFIG_LWIP_TCP_WND_DEFAULT=5744

# Task watchdog, with panic-and-reboot. This device sits on a desk in a living
# room with nothing plugged into it, so "hung until someone notices" is the worst
# possible failure: the panel keeps showing a stale but plausible aircraft and
# nobody can tell. A reboot loses nothing — the route cache is rebuilt in one
# poll — so rebooting always beats hanging here.
# 30 s is generous against a slow render; the UI task feeds it every 2 s.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y

# IPv6 OFF. api.adsb.lol publishes AAAA records, lwIP's getaddrinfo() prefers
# IPv6, and this network (like most domestic ones, here and in Thailand) has no
# IPv6 route to the internet. So every poll resolved to 2a03:4000:5f:82:: and
# sat there until the 6 s connect timeout — "select() timeout", forever, on a
# network that was working perfectly.
#
# A desktop browser hides this with Happy Eyeballs (RFC 8305), racing A and AAAA
# and taking whichever answers. lwIP does not race; it takes the first address.
# We speak to three IPv4-reachable hosts and nothing else, so IPv6 buys nothing
# and costs internal SRAM we are short of.
CONFIG_LWIP_IPV6=n

# SNTP asked for the DHCP-supplied NTP server without this enabled, so
# esp_netif_sntp_init() failed outright and the clock was never set:
#   E esp_netif_sntp: Tried to configure SNTP server from DHCP, while disabled
# A hotel or guest network often blocks pool.ntp.org while offering its own.
CONFIG_LWIP_DHCP_GET_NTP_SRV=y

# ---- OTA (docs/PLAN.md M8, docs/DECISIONS.md D44) -------------------------
# Rollback: a freshly written image boots ONCE on probation. Unless it calls
# esp_ota_mark_app_valid_cancel_rollback() the bootloader reverts to the image
# that was working. The failure this guards against is not a corrupt image —
# the bootloader already checks the hash — but a working image that cannot get
# online, which is precisely the state nobody can fix from 9,000 km away.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# HTTPS only, with the Mozilla root bundle. An unauthenticated firmware source
# is a remote root shell with extra steps, and this device sits on hotel and
# holiday-apartment WiFi for months at a time. main/net/ota.c refuses a
# non-https URL as well, because a Kconfig flag is one edit away and code is
# not.
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# TLS buffers live in PSRAM, not internal SRAM. Measured, not assumed: with the
# framebuffer and WiFi up, this board has ~35 KB of internal heap free and its
# largest free block is 15 KB, while mbedtls_ssl_setup() wants a 16 KB inbound
# record buffer plus a 4 KB outbound one. The first real handshake therefore
# failed with mbedtls_ssl_setup returned -0x7F00 (MBEDTLS_ERR_SSL_ALLOC_FAILED)
# — not a network error, an out-of-memory error wearing a network error's
# clothes. There are 4.7 MB of PSRAM sitting idle on the other side of the bus.
#
# DYNAMIC_BUFFER on top of that frees the record buffers between handshakes
# instead of holding 20 KB for the 24 hours until the next check.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
